/*
***************************************************************************
*    模块：BSP_RA8875_Port 
*    描述：板级 RA8875接口 功能模块驱动
           FSMC  Bank1_SRAM4_ADDR ((uint32_t)0x6C000000)
		   WAIT_PIN：PG11
*    作者：Huo
*    时间：2017.12.13
*    版本：UP-Magic-Version 1.0.0
***************************************************************************
*/
#include "BSP_RA8875_Port.h"

/*
***************************************************************************
*	函 数 名: BSP_RA8875_Port_Init
*	功能说明: 配置CPU访问接口，如FSMC. Wait Pin等
*	形    参:  无
*	返 回 值: 无
***************************************************************************
*/
void BSP_RA8875_Port_Init(void)
{
	/* FSMC在 BSP_ParallelBus.c中已经配置好 */
	
	#ifdef USE_WAIT_PIN
	{
		GPIO_InitTypeDef GPIO_InitStructure;
		
		/* 使能 GPIO时钟 */
		RCC_AHB1PeriphClockCmd(RCC_WAIT, ENABLE);
		
		/* 连接到RA8875的BUSY引脚，用GPIO 识别芯片内忙 */
		GPIO_InitStructure.GPIO_Pin = PIN_WAIT;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;     /*　输入上拉　*/
		GPIO_Init(PORT_WAIT, &GPIO_InitStructure);
	}
	#endif
}

#ifdef USE_WAIT_PIN
/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadBusy
*	功能说明: 判断RA8875的WAIT引脚状态
*	形    参: 无
*	返 回 值: 1 表示正忙, 0 表示内部不忙
*********************************************************************************************************
*/
uint8_t RA8875_ReadBusy(void)
{
	if ((PORT_WAIT->IDR & PIN_WAIT) == 0) 
		return 1;
	else 
		return 0;
}
#endif

/*
*********************************************************************************************************
*	函 数 名: RA8875_Delaly1us
*	功能说明: 延迟函数, 不准, 主要用于RA8875 PLL启动之前发送指令间的延迟
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_Delaly1us(void)
{
	volatile uint16_t Count=25;

	while(Count--);	/* 延迟, 不准 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_Delaly1ms
*	功能说明: 延迟函数.  主要用于RA8875 PLL启动之前发送指令间的延迟
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_Delaly1ms(void)
{
	volatile uint32_t Count=24000;

	while(Count--);	/* 延迟, 不准 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteCmd
*	功能说明: 写RA8875指令寄存器
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteCmd(uint8_t _ucRegAddr)
{
	RA8875_REG = _ucRegAddr;	/* 设置寄存器地址 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteData
*	功能说明: 写RA8875指令寄存器
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteData(uint8_t _ucRegValue)
{
	RA8875_RAM = _ucRegValue;	/* 设置寄存器地址 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadData
*	功能说明: 读RA8875寄存器值
*	形    参: 无
*	返 回 值: 寄存器值
*********************************************************************************************************
*/
uint8_t RA8875_ReadData(void)
{
	uint8_t value = 0;
	
	value = RA8875_RAM;		/* 读取寄存器值 */

	return value;	
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_WriteData16
*	功能说明: 写RA8875数据总线，16bit，用于RGB显存写入
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void RA8875_WriteData16(uint16_t _usRGB)
{
	RA8875_RAM = _usRGB;	/* 设置寄存器地址 */
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadData16
*	功能说明: 读RA8875显存，16bit RGB
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
uint16_t RA8875_ReadData16(void)
{
	uint16_t value;
	
	value = RA8875_RAM;		/* 读取寄存器值 */

	return value;	
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_ReadStatus
*	功能说明: 读RA8875状态寄存器
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
uint8_t RA8875_ReadStatus(void)
{
	uint8_t value = 0;
	
	value = RA8875_REG;
	return value;	
}

/*
*********************************************************************************************************
*	函 数 名: RA8875_GetDispMemAddr
*	功能说明: 获得显存地址。
*	形    参: 无
*	返 回 值: 显存地址
*********************************************************************************************************
*/
uint32_t RA8875_GetDispMemAddr(void)
{
	return RA8875_RAM_ADDR;
}
